This project is a way to familiarize myself with [[https://www.ansible.com/][Ansible]]. The goal is
to configure a Raspberry Pi with a freshly installed Raspbian Lite OS
on my local network.

Based on [[https://github.com/giuaig/ansible-raspi-config][this project]].

* Prerequisites

1. Write a Raspian Lite image to the SD card. Enable SSH by placing a
   file named "ssh" onto the SD card's boot partition.

2. Enable Internet access on the managed Rasperry Pi (just plug an
   Ethernet cable in or configure the Wi-Fi credentials).

3. Use ~ssh-copy-id~ on the control node to use PKA for SSH.

4. Make the Raspberry Pi's IP static in the router settings.

* Using Ansible

Check if the Pi is accessible :

#+begin_src sh :results verbatim
  ansible -i hosts -m ping all
#+end_src

#+RESULTS:
: pi01 | SUCCESS => {
:     "ansible_facts": {
:         "discovered_interpreter_python": "/usr/bin/python"
:     },
:     "changed": false,
:     "ping": "pong"
: }
